Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/reference-events_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: events title: SyntheticEvent permalink: docs/events.html layout: docs category: Reference ---
ja: --- id: events title: 合成イベント (SyntheticEvent) permalink: docs/events.html layout: docs category: Reference ---

source: This reference guide documents the `SyntheticEvent` wrapper that forms part of React's Event System.
ja: このリファレンスガイドでは、React のイベントシステムの一部を構成する `SyntheticEvent`（合成イベント）ラッパについて説明します。

source: See the [Handling Events](/docs/handling-events.html) guide to learn more.
ja: 詳細については、[イベント処理](/docs/handling-events.html)ガイドを参照してください。

source: ## Overview {#overview}
ja: ## 概要 {#overview}

source: Your event handlers will be passed instances of `SyntheticEvent`, a cross-browser wrapper around the browser's native event.
ja: イベントハンドラには、`SyntheticEvent` のインスタンスが渡されます。これはブラウザのネイティブイベントに対するクロスブラウザ版のラッパです。

source: It has the same interface as the browser's native event, including `stopPropagation()` and `preventDefault()`, except the events work identically across all browsers.
ja: `stopPropagation()` と `preventDefault()` を含む、ブラウザのネイティブイベントと同じインターフェイスを持ちつつ、ブラウザ間で同じ挙動をするようになっています。

source: If you find that you need the underlying browser event for some reason, simply use the `nativeEvent` attribute to get it.
ja: 何らかの理由で実際のブラウザイベントが必要な場合は、単に `nativeEvent` 属性を使用するだけで取得できます。

source: The synthetic events are different from, and do not map directly to, the browser's native events.
ja: 合成イベントはブラウザのネイティブイベントとは別物であり、直接の対応があるわけでもありません。

source: For example in `onMouseLeave` `event.nativeEvent` will point to a `mouseout` event.
ja: 例えば `onMouseLeave` イベントの場合、`event.nativeEvent` は `mouseout` イベントになっています。

source: The specific mapping is not part of the public API and may change at any time.
ja: 個々の対応については公開 API の範疇ではなく、常に変わる可能性があります。

source: Every `SyntheticEvent` object has the following attributes:
ja: すべての `SyntheticEvent` オブジェクトは以下の属性を持っています。

source: > Note: > > As of v17, `e.persist()` doesn't do anything because the `SyntheticEvent` is no longer [pooled](/docs/legacy-event-pooling.html).
ja: > 補足 > > v17 以降、`SyntheticEvent` は[プーリング](/docs/legacy-event-pooling.html)されなくなったため、`e.persist()` は何も行わなくなります。

source: > Note: > > As of v0.14, returning `false` from an event handler will no longer stop event propagation.
ja: > 補足 > > v0.14 以降、イベントハンドラから `false` を返してもイベントの伝播は止まりません。

source: Instead, `e.stopPropagation()` or `e.preventDefault()` should be triggered manually, as appropriate.
ja: 代わりに、`e.stopPropagation()` または `e.preventDefault()` を手動で呼び出す必要があります。

source: ## Supported Events {#supported-events}
ja: ## サポートするイベント {#supported-events}

source: React normalizes events so that they have consistent properties across different browsers.
ja: React は異なるブラウザ間でも一貫したプロパティを持つようにイベントを正規化します。

source: The event handlers below are triggered by an event in the bubbling phase.
ja: 以下のイベントハンドラはイベント伝搬のバブリングフェーズで呼び出されます。

source: To register an event handler for the capture phase, append `Capture` to the event name; for example, instead of using `onClick`, you would use `onClickCapture` to handle the click event in the capture phase.
ja: キャプチャフェーズのイベントハンドラを登録するには、イベント名に `Capture` を追加します。たとえば、キャプチャフェーズでクリックイベントを処理するには `onClick` の代わりに `onClickCapture` を使用します。

source: - [Clipboard Events](#clipboard-events) - [Composition Events](#composition-events) - [Keyboard Events](#keyboard-events) - [Focus Events](#focus-events) - [Form Events](#form-events) - [Generic Events](#generic-events) - [Mouse Events](#mouse-events) - [Pointer Events](#pointer-events) - [Selection Events](#selection-events) - [Touch Events](#touch-events) - [UI Events](#ui-events) - [Wheel Events](#wheel-events) - [Media Events](#media-events) - [Image Events](#image-events) - [Animation Events](#animation-events) - [Transition Events](#transition-events) - [Other Events](#other-events)
ja: - [クリップボードイベント](#clipboard-events) - [コンポジションイベント](#composition-events) - [キーボードイベント](#keyboard-events) - [フォーカスイベント](#focus-events) - [フォームイベント](#form-events) - [汎用イベント](#generic-events) - [マウスイベント](#mouse-events) - [ポインタイベント](#pointer-events) - [選択イベント](#selection-events) - [タッチイベント](#touch-events) - [UI イベント](#ui-events) - [ホイールイベント](#wheel-events) - [メディアイベント](#media-events) - [画像イベント](#image-events) - [アニメーションイベント](#animation-events) - [遷移イベント](#transition-events) - [その他のイベント](#other-events)

source: ## Reference {#reference}
ja: ## リファレンス {#reference}

source: ### Clipboard Events {#clipboard-events}
ja: ### クリップボードイベント {#clipboard-events}

source: Event names:
ja: イベント名：

source: Properties:
ja: プロパティ：

source: ### Composition Events {#composition-events}
ja: ### コンポジションイベント {#composition-events}

source: ### Keyboard Events {#keyboard-events}
ja: ### キーボードイベント {#keyboard-events}

source: The `key` property can take any of the values documented in the [DOM Level 3 Events spec](https://www.w3.org/TR/uievents-key/#named-key-attribute-values).
ja: `key` プロパティは [DOM Level 3 Events spec](https://www.w3.org/TR/uievents-key/#named-key-attribute-values) に記載されている任意の値を取ることができます。

source: ### Focus Events {#focus-events}
ja: ### フォーカスイベント {#focus-events}

source: These focus events work on all elements in the React DOM, not just form elements.
ja: これらのフォーカスイベントは、フォーム要素だけでなくすべての React DOM 要素で動作します。

source: The `onFocus` event is called when the element (or some element inside of it) receives focus.
ja: `onFocus` イベントは要素（あるいはその内部の別の要素）がフォーカスを受け取った時に呼び出されます。

source: For example, it's called when the user clicks on a text input.
ja: 例えば、ユーザがテキスト入力をクリックした際に呼び出されます。

source: The `onBlur` event handler is called when focus has left the element (or left some element inside of it).
ja: `onBlur` イベントハンドラは要素（あるいはその内部の別の要素）からフォーカスが外れた場合に呼び出されます。

source: For example, it's called when the user clicks outside of a focused text input.
ja: 例えば、ユーザが既にフォーカスされているテキスト入力の外側でクリックした場合に呼び出されます。

source: #### Detecting Focus Entering and Leaving {#detecting-focus-entering-and-leaving}
ja: #### フォーカスが当たった・外れたことの検出 {#detecting-focus-entering-and-leaving}

source: You can use the `currentTarget` and `relatedTarget` to differentiate if the focusing or blurring events originated from _outside_ of the parent element.
ja: `currentTarget` と `relatedTarget` を用いることで、フォーカスが当たった・外れた際のイベントが親要素の*外側*で起こったかどうかを判定できます。

source: Here is a demo you can copy and paste that shows how to detect focusing a child, focusing the element itself, and focus entering or leaving the whole subtree.
ja: 以下のコピー・ペーストで使えるデモでは、子要素のどれかへのフォーカス、要素自身へのフォーカス、サブツリー全体から出入りするフォーカスを、それぞれどのように検出するかを示しています。

source: ### Form Events {#form-events}
ja: ### フォームイベント {#form-events}

source: For more information about the onChange event, see [Forms](/docs/forms.html).
ja: onChange イベントの詳細については、[Forms](/docs/forms.html) を参照してください。

source: ### Generic Events {#generic-events}
ja: ### 汎用イベント {#generic-events}

source: ### Mouse Events {#mouse-events}
ja: ### マウスイベント {#mouse-events}

source: The `onMouseEnter` and `onMouseLeave` events propagate from the element being left to the one being entered instead of ordinary bubbling and do not have a capture phase.
ja: `onMouseEnter` と `onMouseLeave` イベントは通常のバブリングとは異なり、（ポインタが）出て行った要素から入ってきた要素に伝播し、キャプチャフェーズを持ちません。

source: ### Pointer Events {#pointer-events}
ja: ### ポインタイベント {#pointer-events}

source: The `onPointerEnter` and `onPointerLeave` events propagate from the element being left to the one being entered instead of ordinary bubbling and do not have a capture phase.
ja: `onPointerEnter` と `onPointerLeave` イベントは通常のバブリングとは異なり、（ポインタが）出て行った要素から入ってきた要素に伝播し、キャプチャフェーズを持ちません。

source: As defined in the [W3 spec](https://www.w3.org/TR/pointerevents/), pointer events extend [Mouse Events](#mouse-events) with the following properties:
ja: [W3 spec](https://www.w3.org/TR/pointerevents/) に定義されている通り、ポインタイベントは下記のプロパティを持つマウスイベントの拡張です。

source: A note on cross-browser support:
ja: クロスブラウザサポートについての補足：

source: Pointer events are not yet supported in every browser (at the time of writing this article, supported browsers include: Chrome, Firefox, Edge, and Internet Explorer).
ja: すべてのブラウザでポインタイベントがサポートされているわけではありません（この記事の執筆時点でサポートされているブラウザは、Chrome、Firefox、Edge、および Internet Explorer です）。

source: React deliberately does not polyfill support for other browsers because a standard-conform polyfill would significantly increase the bundle size of `react-dom`.
ja: 標準に準拠したポリフィルは `react-dom` のバンドルサイズを大幅に増加させるため、React は意図的にその他ブラウザのためのポリフィルを提供しません。

source: If your application requires pointer events, we recommend adding a third party pointer event polyfill.
ja: アプリケーションでポインタイベントが必要な場合は、サードパーティのポインタイベントポリフィルを追加することをお勧めします。

source: ### Selection Events {#selection-events}
ja: ### 選択イベント {#selection-events}

source: ### Touch Events {#touch-events}
ja: ### タッチイベント {#touch-events}

source: ### UI Events {#ui-events}
ja: ### UI イベント {#ui-events}

source: >Note > >Starting with React 17, the `onScroll` event **does not bubble** in React.
ja: >補足 > >React 17 以降、`onScroll` イベントは**バブルしなく**なりました。

source: This matches the browser behavior and prevents the confusion when a nested scrollable element fires events on a distant parent.
ja: これはブラウザの挙動と合致しており、スクロール可能な要素がネストされている場合に離れた親要素に対してイベントが発火する場合に起きる混乱を回避できます。

source: ### Wheel Events {#wheel-events}
ja: ### ホイールイベント {#wheel-events}

source: ### Media Events {#media-events}
ja: ### メディアイベント {#media-events}

source: ### Image Events {#image-events}
ja: ### 画像イベント {#image-events}

source: ### Animation Events {#animation-events}
ja: ### アニメーションイベント {#animation-events}

source: ### Transition Events {#transition-events}
ja: ### 遷移イベント {#transition-events}

source: ### Other Events {#other-events}
ja: ### その他のイベント {#other-events}
